Repository: Robot-meow/telegram-bot-get-my-id
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

source: Bot started! My id: <code>{bot_me_id}</> My username: @{bot_me_username} <b>Default locale:</> <b>{default_locale}</>. <b>Available locales:</> <b>{awaible_locales}</>. <b>Default timezone:</> <b>{default_timezone}</>. <b>Start time:</> <b>{_start_time}</>.
ru: Бот запущен! Мой ID: <code>{bot_me_id}</> Мой username: @{bot_me_username} <b>Локализация по-умолчанию:</> <b>{default_locale}</>. <b>Доступная локализация:</> <b>{awaible_locales}</>. <b>Временная зона по-умолчанию:</> <b>{default_timezone}</>. <b>Время запуска:</> <b>{_start_time}</>.

source: <b>Bot stopped!</> <b>Time stopped:</> <b>{time_stopped}</> <b>Working time:</> {_working_time}
ru: <b>Бот остановлен!</> <b>Время завершения:</> <b>{time_stopped}</> <b>Время работы:</> {_working_time}

source: My repository on github
ru: Мой репозиторий на github

source: <i>Your account ID:</i> <code>{user_account_id}</> <i>Current chat ID:</i> <code>{current_chat_id}</> <i>Current message ID:</i> <code>{current_message_id}</>
ru: <i>Ваш ID:</i> <code>{user_account_id}</> <i>ID этого чата:</i> <code>{current_chat_id}</> <i>ID этого сообщения:</i> <code>{current_message_id}</>

source: <i>Your account ID:</i> <code>{user_account_id}</>
ru: <i>Ваш ID:</i> <code>{user_account_id}</>

source: <i>Forward from account ID:</i> <code>{forward_from_id}</>
ru: <i>ID аккаунта, от которого переслали сообщение:</i> <code>{forward_from_id}</>

source: <i>Forward from chat ID:</i> <code>{forward_from_chat_id}</> <i>Forward from message ID:</i> <code>{forward_from_message_id}</>
ru: <i>ID чата, с которого переслали сообщение:</i> <code>{forward_from_chat_id}</> <i>ID сообщения, из чата:</i> <code>{forward_from_message_id}</>

source: <i>Your account ID:</i> <code>{user_account_id}</> {forward_from_info}{forward_from_chat_info}
ru: <i>Ваш ID:</i> <code>{user_account_id}</> {forward_from_info}{forward_from_chat_info}

source: My commands. /start - <b>Start bot.</> /help - <b>Help menu.</> /getchatid - <b>Give current chat ID.</> /getmyid - <b>Give Your account ID.</> This bot allows you to find out the user ID, message or chat. Add the bot to the chat and use the /getmyid or /getchatid command to find out <b>Your ID</> or <b>Chat ID</>, respectively. You can also write in private messages to the bot to find out <b>Your ID</> or forward a message to <b>Another user</> and get information about him. {link_to_repo}.
ru: Мои команды. /start - <b>Запуск бота.</> /help - <b>Вспомогательное меню.</> /getchatid - <b>Получить ID текущего чата.</> /getmyid - <b>Получить ваш ID.</> Этот бот позволяет вам узнать идентификатор пользователя, сообщение или чат. Добавьте бота в чат и используйте команду /getmyid или /getchatid, чтобы узнать <b>Свой ID</> или <b>ID текущего чата</> соответственно. Вы также можете написать в личных сообщениях мне, чтобы узнать <b>Свой ID</> или отправьте сообщение <b>Другого пользователя</> и получите информацию о нем. {link_to_repo}.

source: Welcome, <b>{user_account_full_name}</>! My username - @{bot_me_username} Use the /help command to familiarize yourself with me. <i>Your account ID:</i> {user_account_id} <i>Your account username:</i> {user_account_username}
ru: Добро пожаловать, <b>{user_account_full_name}</>! Мой username - @{bot_me_username} Используйте команду /help, чтобы получше ознакомится со мной. <i>Ваш ID:</i> {user_account_id} <i>Ваш username:</i> {user_account_username}

source: My repository on GitHub.
ru: Мой репозиторий на GitHub.
